In [8]:
import pandas as pd
import numpy as np

In [11]:
people = {
    'First':['Keshav','Rahul','Rajesh','kapil',np.nan, None,'NA'],
    'Last' :['Sharma','Sharma','Kushwaha','sharma',np.nan,np.nan,'Missing'],
    'Email':['Kesh4118@gmail.com','Rahul81.rs@gmail.com','Kush@gmail.com',None,np.nan,'Anonymous@email.com','NA'],
    'age' : ['33','55','63','36',None,None,'Missing']
}

In [12]:
df = pd.DataFrame(people)

In [13]:
df

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
3   kapil    sharma                  None       36
4     NaN       NaN                   NaN     None
5    None       NaN   Anonymous@email.com     None
6      NA   Missing                    NA  Missing

In [14]:
df.dropna()

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
6      NA   Missing                    NA  Missing

In [15]:
df.dropna(axis='index',how='any')

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
6      NA   Missing                    NA  Missing

In [16]:
df.dropna(axis='index',how='all')

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
3   kapil    sharma                  None       36
5    None       NaN   Anonymous@email.com     None
6      NA   Missing                    NA  Missing

In [17]:
df.dropna(axis='columns',how='any')

Empty DataFrame
Columns: []
Index: [0, 1, 2, 3, 4, 5, 6]

In [19]:
df.dropna(axis='index',how='any',subset=['Email'])

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
5    None       NaN   Anonymous@email.com     None
6      NA   Missing                    NA  Missing

In [20]:
df.dropna(axis='index',how='all',subset=['Email'])

    First      Last                 Email      age
0  Keshav    Sharma    Kesh4118@gmail.com       33
1   Rahul    Sharma  Rahul81.rs@gmail.com       55
2  Rajesh  Kushwaha        Kush@gmail.com       63
5    None       NaN   Anonymous@email.com     None
6      NA   Missing                    NA  Missing